{
  "slug": "developer-activity-purchase-intent",
  "title": "What developer activity actually tells you about who's ready to buy",
  "date": "2025-01-14",
  "category": "growth",
  "excerpt": "After analyzing developer activity across 20+ organizations, I found that accounts with high dev engagement are 3x more likely to be at the bottom of the sales funnel. Here's what that means for developer-focused companies.",
  "content": "<p style=\"margin-bottom: 1.5rem;\">Developers are increasingly driving tech purchasing decisions. According to the 2023 StackOverflow Survey, a staggering 66% of developers influence what their companies buy. BCG's research backs this up too—developers are becoming key players in shaping technology acquisition.</p><p style=\"margin-bottom: 1.5rem;\">This got me thinking: if you're seeing high developer activity from an organization around your product, does that actually signal higher purchase intent?</p><p style=\"margin-bottom: 1.5rem;\">This question matters for two reasons. First, sales leaders often dismiss developer activity signals when building pipeline. They assume these developers only want the free tier or open-source offering, so they never pursue these accounts. Second, if this thesis holds true, developer-focused companies are sitting on mountains of intent signals they could be monetizing.</p><h2 style=\"font-size: 1.5rem; font-weight: 600; margin-top: 2.5rem; margin-bottom: 1rem;\">What I found</h2><p style=\"margin-bottom: 1.5rem;\">After working with multiple customers and analyzing their data, here's what stood out:</p><ul style=\"margin-bottom: 1.5rem; padding-left: 1.5rem; list-style-type: disc;\"><li style=\"margin-bottom: 0.5rem;\">Accounts with developer activity are <strong>3x more likely</strong> to be at the bottom of the sales funnel than at the top</li><li style=\"margin-bottom: 0.5rem;\">The deeper you go in the purchase funnel, the more you see accounts with intense developer activity</li><li style=\"margin-bottom: 0.5rem;\">7 out of 10 accounts with developer activity at the bottom of funnel had 'High' activity scores</li></ul><h2 style=\"font-size: 1.5rem; font-weight: 600; margin-top: 2.5rem; margin-bottom: 1rem;\">How I analyzed this</h2><p style=\"margin-bottom: 1.5rem;\">For this analysis, I looked at developer activity from multiple public and first-party sources across 20+ organizations with significant bottom-up developer motions. The data sources included:</p><ul style=\"margin-bottom: 1.5rem; padding-left: 1.5rem; list-style-type: disc;\"><li style=\"margin-bottom: 0.5rem;\">Organizations' owned GitHub projects</li><li style=\"margin-bottom: 0.5rem;\">Competing GitHub projects in the same space</li><li style=\"margin-bottom: 0.5rem;\">Package manager installations (NPM, Helm) and Docker pulls</li><li style=\"margin-bottom: 0.5rem;\">Developer activity on technical documentation</li><li style=\"margin-bottom: 0.5rem;\">Activity on cloud products</li><li style=\"margin-bottom: 0.5rem;\">Open source commit data scraped to create developer activity metrics</li></ul><p style=\"margin-bottom: 1.5rem;\">I triangulated this developer activity into account-level insights using custom tools I've built for customers, then imported everything into their CRMs for analysis.</p><p style=\"margin-bottom: 1.5rem;\">I categorized accounts into three Developer Activity Score bands: High (top 10 percentile), Medium (next 30 percentile), and Low (bottom 60 percentile) based on a proprietary algorithm that translates various developer activities into these bands.</p><h2 style=\"font-size: 1.5rem; font-weight: 600; margin-top: 2.5rem; margin-bottom: 1rem;\">The correlation is real</h2><p style=\"margin-bottom: 1.5rem;\">My initial hypothesis was to understand the correlation between Developer Activity Score and accounts sitting in the 'lead' stage of CRM. Validating this would establish Developer Activity Score as a proxy for identifying \"hot\" accounts with higher likelihood of being further down the funnel.</p><p style=\"margin-bottom: 1.5rem;\">At an overall level, I found that 1 in 6 accounts typically in the Lead stage are captured in my tooling with their developer activity tracked across docs, open source repos, product usage, website visits, and community engagement. I used this as the baseline for all analysis.</p><p style=\"margin-bottom: 1.5rem;\">Looking deeper into the funnel, the ratio of accounts in Opportunity/Deal stage was <strong>2.06x the baseline</strong>—about 1 in 3 accounts at this stage showed some level of developer activity.</p><p style=\"margin-bottom: 1.5rem;\">For Customer accounts, the correlation was even stronger. The ratio jumped to <strong>3.18x the baseline</strong>. Nearly 1 in 2 paying customers had measurable developer activity.</p><img src=\"/blog/developer-activity-purchase-intent/funnel-correlation.png\" alt=\"Chart showing developer activity correlation across sales funnel stages\" style=\"width: 100%; margin: 2rem 0; border-radius: 0.5rem;\" /><h2 style=\"font-size: 1.5rem; font-weight: 600; margin-top: 2.5rem; margin-bottom: 1rem;\">Activity intensity matters too</h2><p style=\"margin-bottom: 1.5rem;\">This analysis was eye-opening because it clearly showed that accounts with developer activity are more common at the bottom of the funnel than the top. But I wanted to dig deeper: does the <em>intensity</em> of developer activity also increase along the sales funnel?</p><p style=\"margin-bottom: 1.5rem;\">When I analyzed Developer Activity Scores across CRM lifecycle stages, the correlation got even stronger:</p><ul style=\"margin-bottom: 1.5rem; padding-left: 1.5rem; list-style-type: disc;\"><li style=\"margin-bottom: 0.5rem;\">~45% of accounts in CRM come from 'Medium and High' activity bands—these show deeper engagement beyond just lone-wolf developers poking around</li><li style=\"margin-bottom: 0.5rem;\">~65% of accounts in Opportunity stage come from 'Medium and High' activity accounts</li><li style=\"margin-bottom: 0.5rem;\">Nearly 4 out of 5 (78%) Customer accounts have 'Medium and High' activity associated with them</li></ul><img src=\"/blog/developer-activity-purchase-intent/activity-intensity.png\" alt=\"Chart showing developer activity intensity across CRM lifecycle stages\" style=\"width: 100%; margin: 2rem 0; border-radius: 0.5rem;\" /><p style=\"margin-bottom: 1.5rem;\">Looking exclusively at 'High' Activity accounts made this even clearer: 70% of accounts with developer activity at the bottom of funnel stages were 'High' activity accounts. This aligns perfectly with the hypothesis that advanced engagement with a dev tool typically converts into paying customers.</p><img src=\"/blog/developer-activity-purchase-intent/high-activity-accounts.png\" alt=\"Chart showing high activity accounts at bottom of funnel\" style=\"width: 100%; margin: 2rem 0; border-radius: 0.5rem;\" /><h2 style=\"font-size: 1.5rem; font-weight: 600; margin-top: 2.5rem; margin-bottom: 1rem;\">The hidden funnel problem</h2><p style=\"margin-bottom: 1.5rem;\">All of this points to one thing: Developer Activity correlates with sales opportunity, and these signals capture purchase intent in a significant way.</p><p style=\"margin-bottom: 1.5rem;\">But here's the kicker. All my analysis was on accounts already in the CRM. Once I established this correlation, I realized accounts <em>not</em> in the CRM but with high or medium developer activity also have significant sales potential.</p><p style=\"margin-bottom: 1.5rem;\">When I looked at this data, I found that <strong>83.4% of accounts</strong> with any developer activity around the analyzed products weren't in the CRM at all. This makes sense when you think about it—developers are mostly active outside of signups. They're on your open source projects, documentation, support communities, and other assets. They often don't sign up or leave identifying information.</p><p style=\"margin-bottom: 1.5rem;\">The numbers reveal a massive problem: roughly 5x the accounts with developer activity and correlated sales opportunities are completely invisible to most companies.</p><img src=\"/blog/developer-activity-purchase-intent/hidden-funnel.png\" alt=\"Chart showing percentage of accounts with developer activity not in CRM\" style=\"width: 100%; margin: 2rem 0; border-radius: 0.5rem;\" /><h2 style=\"font-size: 1.5rem; font-weight: 600; margin-top: 2.5rem; margin-bottom: 1rem;\">What this means for developer GTM leaders</h2><p style=\"margin-bottom: 1.5rem;\">This data reinforces the core thesis of developer marketing and bottom-up developer motion: developers strongly champion and influence purchase decisions within their organizations.</p><p style=\"margin-bottom: 1.5rem;\">Here's what I think GTM leaders at developer-focused companies should take away:</p><h3 style=\"font-size: 1.25rem; font-weight: 600; margin-top: 2rem; margin-bottom: 0.75rem;\">Make developer activity your first qualifier</h3><p style=\"margin-bottom: 1.5rem;\">Every mature GTM motion starts with qualified accounts. Today, developer-focused companies use multiple approaches—cold outreach on ICP segments, website visit signals, product signups.</p><p style=\"margin-bottom: 1.5rem;\">Based on this data, accounts with active developers around your product or community should be your first qualifier. Overlap this data with your ICP criteria to build target account lists. Then, based on developer activity maturity, define your GTM strategy. If you see one or two developers just starting to explore, lean into nurturing and education. If the account is ripe with multiple active developers, it's ready for outreach.</p><h3 style=\"font-size: 1.25rem; font-weight: 600; margin-top: 2rem; margin-bottom: 0.75rem;\">Use developer activity to prioritize mid-funnel accounts</h3><p style=\"margin-bottom: 1.5rem;\">Since developer activity positively correlates with sales probability, it's a powerful signal for sales executives to prioritize their pipeline. Sales teams always have long lists of accounts to close, and deciding which to focus on is a constant challenge.</p><p style=\"margin-bottom: 1.5rem;\">Traditional intent tools track email opens and proposal views—great for business buyers, but developers are active on completely different assets: docs, CLI commands, product trials. Giving sales executives visibility into developer activity trends helps them prioritize and tailor their pitch.</p><h3 style=\"font-size: 1.25rem; font-weight: 600; margin-top: 2rem; margin-bottom: 0.75rem;\">Build tooling for developer data mining</h3><p style=\"margin-bottom: 1.5rem;\">While all this might sound logical, analyzing developer activity is genuinely hard. Most developer activities are anonymous. Developers sign up with burner emails, use their GitHub or StackOverflow identities, or evaluate your docs without signing up at all. Much of the developer experience (DX) stack is specifically designed to let developers evaluate without commitment.</p><p style=\"margin-bottom: 1.5rem;\">You need tooling to understand and triangulate developer intent. The stack requirements are real, but the payoff is visibility into that hidden 83% of your potential pipeline.</p><img src=\"/blog/developer-activity-purchase-intent/tooling-stack.png\" alt=\"Diagram showing the tooling stack required for developer data mining\" style=\"width: 100%; margin: 2rem 0; border-radius: 0.5rem;\" /><h2 style=\"font-size: 1.5rem; font-weight: 600; margin-top: 2.5rem; margin-bottom: 1rem;\">Emerging playbooks for converting developer activity</h2><p style=\"margin-bottom: 1.5rem;\">The data shows developer activity correlates with sales opportunity. But it's equally important to understand that analyzing developer motion gives you both accounts and individual developer leads. Meaningless outreach to either won't help. Unlike other marketing motions, qualification is especially critical in developer-focused GTM.</p><p style=\"margin-bottom: 1.5rem;\">Here are some emerging trends I'm seeing work:</p><h3 style=\"font-size: 1.25rem; font-weight: 600; margin-top: 2rem; margin-bottom: 0.75rem;\">Think accounts, not leads</h3><p style=\"margin-bottom: 1.5rem;\">Champions in developer-led GTM are using account-based strategies. Instead of looking at opportunity from individual developer activities, they're building complete account pictures and prioritizing based on activity trends. When you shift from developer-level to account-level analysis, you see broader opportunities and get better signals.</p><h3 style=\"font-size: 1.25rem; font-weight: 600; margin-top: 2rem; margin-bottom: 0.75rem;\">Find the right time to engage</h3><p style=\"margin-bottom: 1.5rem;\">Not all developer activity means sales opportunity—but sales opportunity matures with developer activity. The developer activity lifecycle in a product purchase typically moves through four stages:</p><ol style=\"margin-bottom: 1.5rem; padding-left: 1.5rem; list-style-type: decimal;\"><li style=\"margin-bottom: 0.5rem;\"><strong>Pioneering:</strong> A champion developer discovers your product and starts exploring</li><li style=\"margin-bottom: 0.5rem;\"><strong>Surge:</strong> More developers join the evaluation. Activity spikes as teams tinker and explore</li><li style=\"margin-bottom: 0.5rem;\"><strong>Evaluation:</strong> The buyer in the organization becomes aware. Users go deeper, building POCs. Activity intensifies as multiple developers or teams engage</li><li style=\"margin-bottom: 0.5rem;\"><strong>Decisioning:</strong> The buyer builds a business case. Developer teams qualify solutions and make recommendations</li></ol><img src=\"/blog/developer-activity-purchase-intent/activity-lifecycle.png\" alt=\"Diagram showing the four stages of developer activity lifecycle\" style=\"width: 100%; margin: 2rem 0; border-radius: 0.5rem;\" /><p style=\"margin-bottom: 1.5rem;\">Timing matters enormously. Rush in too early and the buyer isn't involved yet. Wait too long and they've moved to a competitor or adopted an open source alternative.</p><p style=\"margin-bottom: 1.5rem;\">The right time to reach out is typically when stage 2 is maturing—usually when 2+ developers get active around the same time and you see activity surges.</p><h3 style=\"font-size: 1.25rem; font-weight: 600; margin-top: 2rem; margin-bottom: 0.75rem;\">Build winning DevX to win the GTM game</h3><p style=\"margin-bottom: 1.5rem;\">For an evaluation to mature, it has to pass through early discovery and pioneering stages. These developers are solving their organization's tech problems before any business case exists for GTM teams. The best engagement strategy here is building the right developer experience to help them discover and learn your product as quickly and easily as possible.</p><p style=\"margin-bottom: 1.5rem;\">The best developer GTM teams lead through education and developer relations. They ensure developers get the best experience understanding and tinkering with the product.</p><h3 style=\"font-size: 1.25rem; font-weight: 600; margin-top: 2rem; margin-bottom: 0.75rem;\">Separate your user and buyer databases</h3><p style=\"margin-bottom: 1.5rem;\">Developer-led GTM is a hybrid motion with two distinct personas. Buyers and Users (developers) have completely different needs and motivations around your product. The same messaging won't work for both—yet most marketers don't differentiate between them. Developers get sales messaging while buyers get technical nurtures.</p><p style=\"margin-bottom: 1.5rem;\">Champion GTM leaders clearly distinguish between buyers and users, designing different messaging strategies aligned with each persona's motivations and incentives.</p><hr style=\"margin: 2.5rem 0; border: none; border-top: 1px solid #e5e5e5;\" /><p style=\"margin-bottom: 1.5rem;\">The bottom line? Developer activity is a goldmine of intent signals that most companies are ignoring. The correlation to sales opportunity is clear. The question is whether you're set up to capture and act on it.</p>"
}
